[
	"A 'Shuffle' button is added to all channel and video pages on YouTube, the button has the same behaviour as shuffling from the popup!",
	"If you are the first person to shuffle from a channel, the video ID's of that channel are saved both locally and in a remote database for other users to use!",
	"Try using the extension on April 1st - maybe something unexpected will happen!",
	"The extension does not collect any personal information, it only stores video ID's of channels you shuffle from, without linking them back to you!",
	"You only have certain number of requests to the YouTube API per day. You can remove this limit by providing your own API key in the options!",
	"The extension popup shows you how many videos you have shuffled so far!",
	"The list of videos uploaded on a channel is updated every 48 hours, so don't worry if you don't immediately see the latest video in the shuffle!",
	"All video ID's are stored locally in your browser's cache, to make shuffling from a channel even faster the next time you visit it!",
	"If it ever happens that the 'Shuffle' button is not displayed, simply reload the page and it will be there again!",
	"The 'Shuffle' button will display a progress percentage if it notices that a shuffle will not complete immediately!",

	"Whenever an error is encountered, an alert will open with more detailed information on what caused it, and how you may resolve it. If you still need assistence, please open an issue on GitHub!",
	
	"Use the 'Open in new tab' option in the extension popup to open each shuffled video in its own tab!",
	"Use the 'Reuse new tab' option to only open a new tab on the first shuffle, and open subsequent shuffles in the same tab!",
	"Use the 'Open in playlist' option to open shuffled videos in the uploads playlist of the channel!",
	"Use the 'Use custom API key' option to provide your own YouTube API key, which will be used instead of the extension's keys. This removes the API quota limit!",
	"The extension popup allows you to customize the shuffling experience for the most recently visited channel at any time!",
	"You can choose from a number of filters to choose what videos are considered when shuffling from a specific channel!",
	"The 'Shuffle' button in the popup always shuffles from your most recently visited channel!",

	"If you provide a custom YouTube API key, it will be validated to make sure you can use it with the extension!",
	"If you provide your own YouTube API key, you are able to opt out of sharing video ID's with the extension's database!",
	"If you provide a custom YouTube API key, it is never shared with the extension's database, and only stored locally!",

	"I got the idea for this extension when I was bored and didn't know which video from my favourite channel to watch!",
	"Do you have an idea on how this extension could be improved? Open an issue on GitHub!",
	"If you are enjoying this extension, please consider leaving a review on the Chrome Web Store to help others find it!",
	"This extension is a hobby project - you can support it by sponsoring me on GitHub!",
	"Are you wondering what changed with the most recent update? Check out the changelog on GitHub!",
	"The extension's source code is available on GitHub: https://github.com/NikkelM/Random-YouTube-Video"
]